; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v7 - type_1 ?v4 - type_3)
 	      (pred_1 ?v8 - object ?v4 - type_3)
	      (pred_2 ?v7 - type_1 ?v2 - type_2)
	      (pred_3 ?v7 - type_1 ?v8 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v7 - type_1 ?v3 ?v6 - type_3)
       :precondition (and  (pred_4 ?v7 ?v3))
       :effect (and  (pred_4 ?v7 ?v6)
		     (not (pred_4 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_4 ?v7 ?v5) (pred_2 ?v7 ?v2))
       :effect (and (pred_3 ?v7 ?v1 ?v2)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_2 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_1 ?v1 - object ?v5 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v1 ?v2) (pred_4 ?v7 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_2 ?v7 ?v2)
		    (not (pred_3 ?v7 ?v1 ?v2)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_1
obj_04 obj_06 - type_2
obj_09 obj_10 obj_02 obj_05 - type_3
obj_03 obj_08 obj_07 - object)
(:init
(pred_4 obj_01 obj_05)
(pred_2 obj_01 obj_04)
(pred_2 obj_01 obj_06)
(pred_1 obj_03 obj_09)
(pred_1 obj_08 obj_10)
(pred_1 obj_07 obj_05)
)
(:goal
(and
(pred_1 obj_03 obj_10)
(pred_1 obj_08 obj_02)
(pred_1 obj_07 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_01 ?b obj_06))))
)
)

; plan
1. (op_2 obj_01 obj_05 obj_09)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_09)
   goals met: 1 of 3
2. (op_3 obj_01 obj_03 obj_09 obj_04)
   deleted: (pred_1 obj_03 obj_09) (pred_2 obj_01 obj_04)
   added: (pred_3 obj_01 obj_03 obj_04)
   goals met: 1 of 3
3. (op_2 obj_01 obj_09 obj_10)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_10)
   goals met: 1 of 3
4. (op_1 obj_01 obj_03 obj_10 obj_04)
   deleted: (pred_3 obj_01 obj_03 obj_04)
   added: (pred_1 obj_03 obj_10) (pred_2 obj_01 obj_04)
   goals met: 2 of 3
5. (op_3 obj_01 obj_08 obj_10 obj_04)
   deleted: (pred_1 obj_08 obj_10) (pred_2 obj_01 obj_04)
   added: (pred_3 obj_01 obj_08 obj_04)
   goals met: 2 of 3
6. (op_2 obj_01 obj_10 obj_02)
   deleted: (pred_4 obj_01 obj_10)
   added: (pred_4 obj_01 obj_02)
   goals met: 2 of 3
7. (op_1 obj_01 obj_08 obj_02 obj_04)
   deleted: (pred_3 obj_01 obj_08 obj_04)
   added: (pred_1 obj_08 obj_02) (pred_2 obj_01 obj_04)
   goals met: 3 of 3
